def show_local():
    global x  # ประกาศว่า x เป็นตัวแปร global
    y = 10  # ตัวแปร local ใช้ได้เฉพาะภายในฟังก์ชันนี้
    x = x + y  # ใช้ค่า x จาก global และเพิ่มค่า y
    print("x = ", x)  # แสดงค่าของ x หลังจากการคำนวณ
    print("y = ", y)  # แสดงค่าของ y (ค่าคงที่ 10)

x = 5  # กำหนดค่าให้ x ใน global scope
show_local()  # เรียกฟังก์ชัน -> x จะถูกเปลี่ยนเป็น 15 (5+10)

x = 15  # กำหนดค่าใหม่ให้ x ใน global scope
y = 10  # สร้างตัวแปร y ใหม่ใน global scope (ไม่มีผลต่อ y ในฟังก์ชัน)
print(x)  # แสดงค่าของ x ที่ถูกเปลี่ยนเป็น 15