#(Empty List)
A = []  # ลิสต์ที่ไม่มีสมาชิก
print(A)  # []
#ลิสต์ A เป็นลิสต์ที่ไม่มีสมาชิกใดๆ เรียกว่า ลิสต์เปล่า

#ลิสต์ที่มีสมาชิกเดียวกัน
B = [0, 1, 2]  # ลิสต์ที่มีสมาชิกเป็นตัวเลข
print(B)  # [0, 1, 2]
#ลิสต์ B ประกอบไปด้วยสมาชิกตัวเลข 0, 1, 2

#ลิสต์ที่มีสมาชิกเดียว
D = [5]  # ลิสต์ที่มีสมาชิกเดียว
print(D)  # [5]
#ลิสต์ D มีสมาชิกเดียวคือ 5 ซึ่งต้องใส่เครื่องหมายวงเล็บ [] ตามด้วยค่าที่ต้องการ

#ลิสต์ที่มีสมาชิกหลากหลายประเภท
E = ["Python", 'IT', 20, 3.00]
print(E)  # ['Python', 'IT', 20, 3.00]
#ลิสต์ E ประกอบไปด้วยสมาชิกหลากหลายประเภท ได้แก่ string,int,float